In [2]:
import pandas as pd

In [3]:
df1 =pd.DataFrame({'Key' : ['A', 'B', 'C', 'D'], 'Value' : [1, 2, 3, 4]})
df2 =pd.DataFrame({'Key': ['B', 'D', 'E', 'F'], 'Value': [5, 6, 7, 8]})

In [4]:
df1.head()

  Key  Value
0   A      1
1   B      2
2   C      3
3   D      4

In [5]:
df2.head()

  Key  Value
0   B      5
1   D      6
2   E      7
3   F      8

In [14]:
merged_df = pd.merge (df1, df2, on= 'Key', now ='left')

TypeError: merge() got an unexpected keyword argument 'now'

In [7]:
merged_df

  Key  Value_x  Value_y
0   B        2        5
1   D        4        6

In [15]:
merged_df = pd.merge (df1, df2, on= 'Key', how = 'left')

In [16]:
merged_df

  Key  Value_x  Value_y
0   A        1      NaN
1   B        2      5.0
2   C        3      NaN
3   D        4      6.0

In [17]:
merged_df = pd.merge (df1, df2, on= 'Key', how = 'right')

In [18]:
merged_df

  Key  Value_x  Value_y
0   B      2.0        5
1   D      4.0        6
2   E      NaN        7
3   F      NaN        8